class FillFoodData < ActiveRecord::Migration
  def up
  	[['麻辣鱿鱼', 12],
  	['红烧牛肉', 12],
  	['咖喱鸡丁', 12],
  	['黑胶牛柳', 14],
  	['鸡腿', 12],
  	['耗油牛柳', 12],
  	['醋溜苜蓿', 14],
  	['回锅肉', 14],
  	['菠萝鸡片', 12],
  	['孜然里脊', 12],
  	['苜蓿虾仁', 14],
  	['豆角肉', 10],
  	['葱爆肉', 12],
  	['咖喱牛肉', 11],
  	['番茄牛肉', 11],
  	['孜然鸡片', 11],
  	['鱼香鸡丝', 9],
  	['宫保鸡丁', 9],
  	['耗油鸡片', 9],
  	['地三鲜', 9],
  	['炒肝尖', 9],
  	['麻辣鸡片', 9],
  	['酱爆鸡丁', 9],
  	['鱼香茄子', 9],
  	['青椒土豆丝', 9],
  	['木须肉', 9],
  	['西红柿鸡蛋', 9],
  	['酱爆圆白菜', 9],
  	['锅踏里脊', 10],
  	['老干妈鸡丁', 10],
  	['鱼香鱼豆腐', 10],
  	['鸡丁玉米粒', 10],
  	['水果', 10],
  	['干煸豆角', 10]
  	].each do |item|
  		(name,price) = item
  		Food.create(name: name, price: price)
  	end
  end

  def down
  	Food.delete_all
  end
end
